xml-v4/DataProcessors/TL_НастройкаРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>TL_НастройкаРасширения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

xml-v4/Enums/TL_ТипыСтанций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TL_ТипыСтанций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АЗС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КАЗС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АКАЗС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АГЗС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml-v4/Catalogs/TL_АЗС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TL_АЗС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСтанции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтанции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипыСтанций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗакрытияСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml-v4/Catalogs/TL_ВидыТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TL_ВидыТоплива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураТонны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлотностьСправочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаппингПоСтанциям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АЗС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TL_АЗС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураЛитры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml-v4/Catalogs/TL_ВидыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>TL_ВидыОплат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВнешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентОптовый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

xml-v4/DataProcessors/TL_НастройкаРасширения/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обработка TL_НастройкаРасширения, Форма
// Расширение TradeLedger v3 — Мастер первоначальной настройки
//
// 4 шага:
//   Шаг 1: Организация, основной склад, поставщик, подключение к API
//   Шаг 2: Станции АЗС → Склады 1С
//   Шаг 3: Виды топлива → Номенклатура (тонны + литры по станциям)
//   Шаг 4: Каналы оплат → Виртуальные склады
//
// Структура формы:
//   ГруппаСтраницы (ГруппаСтраниц, БезЗаголовков):
//     ├── СтраницаШаг1
//     ├── СтраницаШаг2
//     ├── СтраницаШаг3
//     └── СтраницаШаг4
//   ГруппаКнопок (горизонтально):
//     ├── КнопкаНазад
//     ├── Заголовок шага
//     └── КнопкаДалее / КнопкаГотово
//
// Реквизиты формы:
//   Простые:
//     ТекущийШаг (Число), Организация (СправочникСсылка.Организации),
//     ОсновнойСклад (СправочникСсылка.Склады),
//     Поставщик (СправочникСсылка.Контрагенты),
//     URLСервера, Логин, Пароль, КодСистемы, ТекстСтатуса
//   Таблицы:
//     ТаблицаСтанций: КодСтанции, Наименование, Склад, ТипСтанции, ВремяСмены
//     ТаблицаТоплива: ВнешнийКод, Название, НоменклатураТонны, Плотность
//     ТаблицаМаппингЛитры: ВнешнийКод, Станция, НоменклатураЛитры
//     ТаблицаОплат: Наименование, КодВнешний, Склад, ТребуетПеремещения, Контрагент
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущийШаг = 1;

	// Загрузить текущие настройки (если есть)
	ЗагрузитьТекущиеНастройки();

	// Заполнить таблицы значениями по умолчанию
	ЗаполнитьТаблицуТопливаПоУмолчанию();
	ЗаполнитьТаблицуОплатПоУмолчанию();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)

	Если ТекущийШаг < 4 Тогда
		ТекущийШаг = ТекущийШаг + 1;
		ОбновитьВидимостьШагов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)

	Если ТекущийШаг > 1 Тогда
		ТекущийШаг = ТекущийШаг - 1;
		ОбновитьВидимостьШагов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)

	СохранитьВсеНастройкиНаСервере();
	ПоказатьПредупреждение(, "Настройка завершена! Теперь откройте TradeLedger для работы.");
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)

	ТекстСтатуса = "Подключение...";
	ПроверитьПодключениеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтанцию(Команда)

	НоваяСтр = ТаблицаСтанций.Добавить();
	НоваяСтр.КодСтанции = 0;
	НоваяСтр.Наименование = "";
	НоваяСтр.ТипСтанции = "АЗС";
	НоваяСтр.ВремяСмены = "07:00";

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТопливо(Команда)

	НоваяСтр = ТаблицаТоплива.Добавить();
	НоваяСтр.ВнешнийКод = "";
	НоваяСтр.Название = "";
	НоваяСтр.Плотность = 0;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ==========================================================================
//  ЗАГРУЗКА ТЕКУЩИХ НАСТРОЕК
// ==========================================================================

&НаСервере
Процедура ЗагрузитьТекущиеНастройки()

	// Организация
	ИмяОрг = TL_Настройки.ПолучитьЗначение("Организация", "");
	Если ЗначениеЗаполнено(ИмяОрг) Тогда
		Организация = Справочники.Организации.НайтиПоНаименованию(ИмяОрг, Истина);
	КонецЕсли;

	// Основной склад
	ИмяСклада = TL_Настройки.ПолучитьЗначение("ОсновнойСклад", "");
	Если ЗначениеЗаполнено(ИмяСклада) Тогда
		ОсновнойСклад = Справочники.Склады.НайтиПоНаименованию(ИмяСклада, Истина);
	КонецЕсли;

	// Поставщик
	ИмяПоставщика = TL_Настройки.ПолучитьЗначение("Поставщик", "");
	Если ЗначениеЗаполнено(ИмяПоставщика) Тогда
		Поставщик = Справочники.Контрагенты.НайтиПоНаименованию(ИмяПоставщика, Истина);
	КонецЕсли;

	// API
	URLСервера = TL_Настройки.ПолучитьЗначение("URLСервера", "https://pos.autooplata.ru/tms");
	Логин = TL_Настройки.ПолучитьЗначение("Логин", "");
	Пароль = TL_Настройки.ПолучитьЗначение("Пароль", "");
	КодСистемы = TL_Настройки.ПолучитьЧисло("КодСистемы", 0);

	// Загрузить существующие станции из TL_АЗС
	ЗагрузитьСтанцииИзСправочника();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтанцииИзСправочника()

	ТаблицаСтанций.Очистить();

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КодСтанции,
			|	Наименование,
			|	Склад,
			|	ТипСтанции,
			|	ВремяЗакрытияСмены
			|ИЗ
			|	Справочник.TL_АЗС
			|ГДЕ
			|	НЕ ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО
			|	КодСтанции";

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр = ТаблицаСтанций.Добавить();
			Стр.КодСтанции = Выборка.КодСтанции;
			Стр.Наименование = Выборка.Наименование;
			Стр.Склад = Выборка.Склад;
			Стр.ТипСтанции = Строка(Выборка.ТипСтанции);
			Стр.ВремяСмены = Формат(Выборка.ВремяЗакрытияСмены, "ДФ='HH:mm'");
		КонецЦикла;
	Исключение
		// Справочник TL_АЗС не существует — начинаем с нуля
	КонецПопытки;

КонецПроцедуры

// ==========================================================================
//  ТАБЛИЦЫ ПО УМОЛЧАНИЮ
// ==========================================================================

&НаСервере
Процедура ЗаполнитьТаблицуТопливаПоУмолчанию()

	Если ТаблицаТоплива.Количество() > 0 Тогда
		Возврат; // Уже заполнена
	КонецЕсли;

	// Загрузить из TL_ВидыТоплива если есть
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВнешнийКод, Наименование, НоменклатураТонны, ПлотностьСправочная
			|ИЗ
			|	Справочник.TL_ВидыТоплива
			|ГДЕ НЕ ПометкаУдаления";

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр = ТаблицаТоплива.Добавить();
			Стр.ВнешнийКод = Выборка.ВнешнийКод;
			Стр.Название = Выборка.Наименование;
			Стр.НоменклатураТонны = Выборка.НоменклатураТонны;
			Стр.Плотность = Выборка.ПлотностьСправочная;
		КонецЦикла;

		Если ТаблицаТоплива.Количество() > 0 Тогда
			// Загрузить маппинг литров по станциям
			ЗагрузитьМаппингЛитровИзСправочника();
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// Значения по умолчанию
	ДобавитьТопливоПоУмолчанию("92",  "АИ-92",    0.735);
	ДобавитьТопливоПоУмолчанию("95",  "АИ-95",    0.750);
	ДобавитьТопливоПоУмолчанию("98",  "АИ-98",    0.765);
	ДобавитьТопливоПоУмолчанию("DT",  "ДТ",       0.840);
	ДобавитьТопливоПоУмолчанию("DTw", "ДТ зимн.", 0.830);

КонецПроцедуры

&НаСервере
Процедура ДобавитьТопливоПоУмолчанию(Код, Название, Плотность)

	Стр = ТаблицаТоплива.Добавить();
	Стр.ВнешнийКод = Код;
	Стр.Название = Название;
	Стр.Плотность = Плотность;

	// Попытка найти номенклатуру
	НомТонн = Справочники.Номенклатура.НайтиПоНаименованию(Название + " (т)", Истина);
	Если ЗначениеЗаполнено(НомТонн) Тогда
		Стр.НоменклатураТонны = НомТонн;
	Иначе
		НомТонн = Справочники.Номенклатура.НайтиПоНаименованию(Название + "(т)", Истина);
		Если ЗначениеЗаполнено(НомТонн) Тогда
			Стр.НоменклатураТонны = НомТонн;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОплатПоУмолчанию()

	Если ТаблицаОплат.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	// Загрузить из TL_ВидыОплат если есть
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Наименование, КодВнешний, Склад, ТребуетПеремещения, КонтрагентОптовый
			|ИЗ
			|	Справочник.TL_ВидыОплат
			|ГДЕ НЕ ПометкаУдаления";

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр = ТаблицаОплат.Добавить();
			Стр.Наименование = Выборка.Наименование;
			Стр.КодВнешний = Выборка.КодВнешний;
			Стр.Склад = Выборка.Склад;
			Стр.ТребуетПеремещения = Выборка.ТребуетПеремещения;
			Стр.Контрагент = Выборка.КонтрагентОптовый;
		КонецЦикла;

		Если ТаблицаОплат.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// Значения по умолчанию (3 канала реализации ГИГ)
	// retail — розница (наличные + банк.карты), без перемещения (Отчёт о розн. продажах)
	ДобавитьОплатуПоУмолчанию("Розница (наличные + эквайринг)",  "retail",  Ложь);
	// cards — топл./корп. карты всех эмитентов → виртуальный склад "Карты"
	ДобавитьОплатуПоУмолчанию("Топливные/корп. карты",           "cards",   Истина);
	// online — Яндекс, мобильные, Benzuber → виртуальный склад "Онлайн"/"ЯНДЕКС"
	ДобавитьОплатуПоУмолчанию("Онлайн-заказы (Яндекс и др.)",   "online",  Истина);

КонецПроцедуры

&НаСервере
Процедура ДобавитьОплатуПоУмолчанию(Наименование, КодВнешний, ТребуетПеремещения)

	Стр = ТаблицаОплат.Добавить();
	Стр.Наименование = Наименование;
	Стр.КодВнешний = КодВнешний;
	Стр.ТребуетПеремещения = ТребуетПеремещения;

	// Попытка найти склад с таким же названием
	Если ТребуетПеремещения Тогда
		// Ищем склад строго по наименованию канала — без fallback на "Карты"
		// чтобы не перепутать склады разных каналов
		Склад = Справочники.Склады.НайтиПоНаименованию(Наименование, Истина);
		Если ЗначениеЗаполнено(Склад) Тогда
			Стр.Склад = Склад;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// ==========================================================================
//  ПРОВЕРКА ПОДКЛЮЧЕНИЯ
// ==========================================================================

&НаСервере
Процедура ПроверитьПодключениеНаСервере()

	Попытка
		Токен = TL_ApiКлиент.Авторизация(URLСервера, Логин, Пароль);
		Если Не ЗначениеЗаполнено(Токен) Тогда
			ТекстСтатуса = "Ошибка: пустой токен. Проверьте логин/пароль.";
			Возврат;
		КонецЕсли;

		// Попробуем получить смены
		Смены = TL_ApiКлиент.ПолучитьСписокСмен(URLСервера, Токен, КодСистемы, 0);
		КолСмен = ?(ТипЗнч(Смены) = Тип("Массив"), Смены.Количество(), 0);

		ТекстСтатуса = "OK! Подключение успешно, найдено смен: " + XMLСтрока(КолСмен);
	Исключение
		ТекстСтатуса = "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

// ==========================================================================
//  СОХРАНЕНИЕ ВСЕХ НАСТРОЕК
// ==========================================================================

&НаСервере
Процедура СохранитьВсеНастройкиНаСервере()

	// --- Шаг 1: Базовые настройки ---
	Если ЗначениеЗаполнено(Организация) Тогда
		TL_Настройки.УстановитьЗначение("Организация", Строка(Организация), "Организация");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОсновнойСклад) Тогда
		TL_Настройки.УстановитьЗначение("ОсновнойСклад", Строка(ОсновнойСклад), "Основной склад (опт, тонны)");
	КонецЕсли;
	Если ЗначениеЗаполнено(Поставщик) Тогда
		TL_Настройки.УстановитьЗначение("Поставщик", Строка(Поставщик), "Поставщик топлива");
	КонецЕсли;

	TL_Настройки.УстановитьЗначение("URLСервера", URLСервера, "URL API STS");
	TL_Настройки.УстановитьЗначение("Логин", Логин, "Логин API");
	TL_Настройки.УстановитьЗначение("Пароль", Пароль, "Пароль API");
	TL_Настройки.УстановитьЗначение("КодСистемы", XMLСтрока(КодСистемы), "Код системы (сети АЗС)");

	// --- Шаг 2: Станции АЗС ---
	СохранитьСтанции();

	// --- Шаг 3: Виды топлива ---
	СохранитьВидыТоплива();

	// --- Шаг 4: Виды оплат ---
	СохранитьВидыОплат();

КонецПроцедуры

&НаСервере
Процедура СохранитьСтанции()

	Попытка
		Для Каждого Стр Из ТаблицаСтанций Цикл
			Если Стр.КодСтанции = 0 Тогда
				Продолжить;
			КонецЕсли;

			// Найти или создать элемент справочника TL_АЗС
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
				|ИЗ Справочник.TL_АЗС
				|ГДЕ КодСтанции = &КодСтанции";
			Запрос.УстановитьПараметр("КодСтанции", Стр.КодСтанции);
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Объект = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				Объект = Справочники.TL_АЗС.СоздатьЭлемент();
			КонецЕсли;

			Объект.КодСтанции = Стр.КодСтанции;
			Объект.Наименование = Стр.Наименование;
			Объект.Склад = Стр.Склад;
			Объект.Активна = Истина;

			// Тип станции
			Попытка
				Если ЗначениеЗаполнено(Стр.ТипСтанции) Тогда
					Если Стр.ТипСтанции = "АЗС" Тогда
						Объект.ТипСтанции = Перечисления.TL_ТипыСтанций.АЗС;
					ИначеЕсли Стр.ТипСтанции = "КАЗС" Тогда
						Объект.ТипСтанции = Перечисления.TL_ТипыСтанций.КАЗС;
					ИначеЕсли Стр.ТипСтанции = "АКАЗС" Тогда
						Объект.ТипСтанции = Перечисления.TL_ТипыСтанций.АКАЗС;
					ИначеЕсли Стр.ТипСтанции = "АГЗС" Тогда
						Объект.ТипСтанции = Перечисления.TL_ТипыСтанций.АГЗС;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;

			// Время закрытия смены
			Попытка
				Если ЗначениеЗаполнено(Стр.ВремяСмены) Тогда
					Объект.ВремяЗакрытияСмены = Дата("00010101" + СтрЗаменить(Стр.ВремяСмены, ":", "") + "00");
				КонецЕсли;
			Исключение
			КонецПопытки;

			Объект.Записать();
		КонецЦикла;
	Исключение
		// Справочник TL_АЗС не существует
		ЗаписьЖурналаРегистрации("TL_НастройкаРасширения",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось сохранить станции: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура СохранитьВидыТоплива()

	Попытка
		Для Каждого Стр Из ТаблицаТоплива Цикл
			Если Не ЗначениеЗаполнено(Стр.ВнешнийКод) Тогда
				Продолжить;
			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
				|ИЗ Справочник.TL_ВидыТоплива
				|ГДЕ ВнешнийКод = &ВнешнийКод";
			Запрос.УстановитьПараметр("ВнешнийКод", Стр.ВнешнийКод);
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Объект = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				Объект = Справочники.TL_ВидыТоплива.СоздатьЭлемент();
			КонецЕсли;

			Объект.Наименование = Стр.Название;
			Объект.ВнешнийКод = Стр.ВнешнийКод;
			Объект.НоменклатураТонны = Стр.НоменклатураТонны;
			Объект.ПлотностьСправочная = Стр.Плотность;

			// Маппинг литров по станциям
			Объект.МаппингПоСтанциям.Очистить();
			Для Каждого СтрМаппинг Из ТаблицаМаппингЛитры Цикл
				Если СтрМаппинг.ВнешнийКод = Стр.ВнешнийКод
					И ЗначениеЗаполнено(СтрМаппинг.НоменклатураЛитры) Тогда

					НоваяСтр = Объект.МаппингПоСтанциям.Добавить();
					НоваяСтр.АЗС = СтрМаппинг.Станция;
					НоваяСтр.НоменклатураЛитры = СтрМаппинг.НоменклатураЛитры;
				КонецЕсли;
			КонецЦикла;

			Объект.Записать();
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("TL_НастройкаРасширения",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось сохранить виды топлива: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура СохранитьВидыОплат()

	Попытка
		Для Каждого Стр Из ТаблицаОплат Цикл
			Если Не ЗначениеЗаполнено(Стр.Наименование) Тогда
				Продолжить;
			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
				|ИЗ Справочник.TL_ВидыОплат
				|ГДЕ КодВнешний = &КодВнешний";
			Запрос.УстановитьПараметр("КодВнешний", Стр.КодВнешний);
			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Объект = Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				Объект = Справочники.TL_ВидыОплат.СоздатьЭлемент();
			КонецЕсли;

			Объект.Наименование = Стр.Наименование;
			Объект.КодВнешний = Стр.КодВнешний;
			Объект.Склад = Стр.Склад;
			Объект.ТребуетПеремещения = Стр.ТребуетПеремещения;
			Объект.КонтрагентОптовый = Стр.Контрагент;
			Объект.Записать();
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("TL_НастройкаРасширения",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось сохранить виды оплат: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// ==========================================================================
//  ЗАГРУЗКА МАППИНГА ЛИТРОВ ПО СТАНЦИЯМ
// ==========================================================================

&НаСервере
Процедура ЗагрузитьМаппингЛитровИзСправочника()

	ТаблицаМаппингЛитры.Очистить();

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Владелец.ВнешнийКод КАК ВнешнийКод,
			|	МаппингПоСтанциям.АЗС КАК Станция,
			|	МаппингПоСтанциям.НоменклатураЛитры КАК НоменклатураЛитры
			|ИЗ
			|	Справочник.TL_ВидыТоплива.МаппингПоСтанциям КАК МаппингПоСтанциям
			|ГДЕ
			|	НЕ Владелец.ПометкаУдаления";

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр = ТаблицаМаппингЛитры.Добавить();
			Стр.ВнешнийКод = Выборка.ВнешнийКод;
			Стр.Станция = Выборка.Станция;
			Стр.НоменклатураЛитры = Выборка.НоменклатураЛитры;
		КонецЦикла;
	Исключение
		// Табличная часть МаппингПоСтанциям не существует
	КонецПопытки;

КонецПроцедуры

// ==========================================================================
//  НАВИГАЦИЯ ПО ШАГАМ
// ==========================================================================

&НаКлиенте
Процедура ОбновитьВидимостьШагов()

	// Управление видимостью страниц
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаШаг" + ТекущийШаг];

	// Кнопка Назад
	Элементы.КнопкаНазад.Видимость = (ТекущийШаг > 1);

	// Кнопка Далее / Готово
	Элементы.КнопкаДалее.Видимость = (ТекущийШаг < 4);
	Элементы.КнопкаГотово.Видимость = (ТекущийШаг = 4);

КонецПроцедуры

#КонецОбласти
